app/Controllers/BaseController.php

    protected function logPageVisit()
    {
        $currentURL = $_SERVER['REQUEST_URI'];

        // Skip logging if the URL contains /admin or /login
        if (strpos($currentURL, '/admin') !== false || strpos($currentURL, '/login') !== false) {
            return;
        }

        try {
            $db = Database::connect();

            $data = [
                'page_url'   => $currentURL,
                'ip_address' => $this->request->getIPAddress() ?? '0.0.0.0',
                'visit_date' => date('Y-m-d H:i:s'),
            ];

            $db->table('visit_data')->insert($data);
---
INSERT INTO `visit_data` (`page_url`, `ip_address`, `visit_date`) VALUES ('/websitebinan/public/', '::1', '2026-06-01 12:35:52')