app/Controllers/Home.php

    public function index()
    {
        $visitModel = new VisitCountModel();
        $contentModel = new \App\Models\Content();
        $mayor_m = new \App\Models\MayorContent();
        $hotline_m = new \App\Models\Hotlines();
        $about_m = new \App\Models\About();

        $data['visit_count'] = $visitModel->getTodayVisitCount();
        $data['announcements'] = $contentModel
            ->where('status', 'ACTIVE')
            ->where('category', 'anns')
            ->orderBy('created_date', 'DESC')
            ->findAll(3);

        $data['news_events'] = $contentModel
            ->where('status', 'ACTIVE')
            ->where('category', 'news')
            ->orderBy('created_date', 'DESC')
            ->findAll(3);

        $data['mayor_content'] = $mayor_m
            ->where('status', 'ACTIVE')
            ->where('section', 'Home Page')
            ->asArray()
            ->first();
---
SELECT *
FROM `mayor_content`
WHERE `status` = 'ACTIVE'
AND `section` = 'Home Page'
 LIMIT 1

            ->asArray()
            ->first();

        $data['hotlines'] = $hotline_m
            ->where('status', 'ACTIVE')
            ->where('section', 'Others')
            ->findAll();
---
SELECT *
FROM `hotlines`
WHERE `status` = 'ACTIVE'
AND `section` = 'Others'

    public function fulldisc()
    {
        $fdisc_m = new \App\Models\FileTbl();
        $fdisc_d = $fdisc_m->where('status', 'ACTIVE')->findAll();
---
SELECT *
FROM `file_tbl`
WHERE `status` = 'ACTIVE'