app/Models/VisitCountModel.php

SELECT *
FROM `visit_counts`
WHERE `visit_date` = '2026-06-01'
AND `ip_address` = '::1'
 LIMIT 1
---
    public function incrementVisitCount($ipAddress)
    {
        $today = date('Y-m-d');
        $visit = $this->where('visit_date', $today)->where('ip_address', $ipAddress)->first();

SELECT *
FROM `visit_counts`
WHERE `visit_date` = '2026-06-01'
---
    public function getTodayVisitCount()
    {
        $today = date('Y-m-d');
        $visits = $this->where('visit_date', $today)->findAll();