app/Models/VisitDataModel.php

    public function getTopPageByWeek()
{
    // Get the start of the current week (Monday) and end (Sunday)
    $startOfWeek = date('Y-m-d 00:00:00', strtotime('last Monday', strtotime('today')));
    $endOfWeek = date('Y-m-d 23:59:59', strtotime('next Sunday', strtotime('today')));

    $pageMap = [
        '/websitebinan/public/home' => 'Home',
        '/websitebinan/public/about' => 'Mission & Vision',
        '/websitebinan/public/officials' => 'City Officials',
        '/websitebinan/public/history' => 'History',
        '/websitebinan/public/invest' => 'Invest',
        '/websitebinan/public/contact' => 'Contact',
        '/websitebinan/public/map' => 'Maps',
        '/websitebinan/public/fulldisc' => 'Full Disclosure Policy',
        '/websitebinan/public/careers' => 'Careers',
        '/websitebinan/public/mayor' => 'Mayors Corner',
        '/websitebinan/public/hotlines' => 'Hotlines',
        '/websitebinan/public/announcements/1' => 'Announcements',
        '/websitebinan/public/jobs' => 'Jobs',
    ];

    // Use CASE to group related URLs
    $result = $this->select("CASE
                                WHEN page_url LIKE '%newsevents%' THEN 'News & Events'
                                WHEN page_url LIKE '%department%' THEN 'Departments'
                                WHEN page_url LIKE '%barangay%' THEN 'Barangays'
                                WHEN page_url LIKE '%Announcement%' THEN 'Announcements'
                                ELSE page_url
                             END as grouped_page_url, COUNT(*) as visit_count")
                   ->where('visit_date >=', $startOfWeek)
                   ->where('visit_date <=', $endOfWeek)
                   ->groupBy('grouped_page_url')
                   ->orderBy('visit_count', 'DESC')
                   ->first();
---
SELECT CASE 
                                WHEN page_url LIKE '%newsevents%' THEN 'News & Events'
                                WHEN page_url LIKE '%department%' THEN 'Departments'
                                WHEN page_url LIKE '%barangay%' THEN 'Barangays'
                                WHEN page_url LIKE '%Announcement%' THEN 'Announcements'
                                ELSE page_url 
                             END as grouped_page_url, COUNT(*) as visit_count
FROM `visit_data`
WHERE `visit_date` >= '2026-05-25 00:00:00'
AND `visit_date` <= '2026-05-31 23:59:59'
GROUP BY `grouped_page_url`
ORDER BY `visit_count` DESC
 LIMIT 1